import os,currency#导入通用包
'''
flow.py#流量
    1.Shop_Flow#店铺流量
        l02=['日期来源','访客数','访客数变化','下单金额','下单金额变化','下单买家数','下单买家数变化','下单转化率','下单转化率变化',
                 '支付金额','支付金额变化','支付买家数','支付买家数变化','支付转化率','支付转化率变化','客单价','客单价变化','UV价值',
                 'uv价值变化','关注店铺买家数','关注店铺买家数变化','收藏商品买家数','收藏商品买家数变化','加购人数','加购人数变化',
                 '新访客','新访客变化','收藏人数','收藏人数变化','跳失率','跳失率变化','浏览量','浏览量变化','人均浏览量','人均浏览量变化',
                 '粉丝支付买家数','直接支付买家数','加购商品-支付买家数','收藏商品-支付买家数','访客数环比']
    2.commodity_Flow#商品来源
        l02=['日期来源','访客数','浏览量','浏览量占比','店内跳转人数','跳出本店人数','收藏人数','加购人数','下单买家数',
                '下单转化率','支付件数','支付买家数','支付金额','支付转化率','直接支付买家数','收藏商品-支付买家数',
                '粉丝支付买家数','加购商品-支付买家数']

compete.py#竟店
    1.cruxIndex#关键指标
        l02=['店铺日期','交易指数','流量指数','搜索人气','收藏人气','加购人气',
                 '预售定金交易指数','预售支付商品件数','上新商品数','支付转化指数','客群指数']
    2.commoditylist#TOP商品
        l02=['店铺日期商品id项目', 'top排名', '指数', '较前一日']
    3.transactionComposition#交易构成
        l02=['日期店铺排名','类目','支付金额占比']
    4.price_band#价格带
        l02=['日期店铺编号','价格带','支付金额占比']
    5.sourceOfEntry##入店来源
        l02=['日期店铺来源','流量指数','客群指数','支付转化指数','交易指数',
             '访客数','支付买家数','支付转化率','支付金额']

competitive goods.py#竟品
    1.goodsCruxIndex#竟品关键指标
        l02=['日期商品id','交易指数','流量指数','搜索人气','收藏人气','加购人气','支付转化指数']
    2.drainageKeywords#引流关键词
        l02=['日期来源商品id词','访客数']
    3.transactionKeywords#成交关键词
        l02=['日期来源商品id词','交易指数']
    4.goodsSourceOfEntry#竟品入店来源
        l02=['日期来源商品id项目','访客数','客群指数','支付转化指数','交易指数']

market Ranking.py#市场排行
    1.shopHighTrading#店铺高交易
        l02=['排名类目日期','店铺信息', '交易金额','交易增长幅度','支付转化率']
    2.shopHighFlow#店铺高流量
        l02=['排名类目日期','店铺信息','访客人数','搜索人数','搜索占比','交易金额','uv价值']
    3.highCommodityTrading#商品高交易
        l02=['排名类目日期','店铺名','商品ID','行业排名','交易金额','交易增长幅度','支付转化率']
    4.highCommodityFlow#商品高流量
        l02=['排名类目日期','店铺名','商品ID','访客人数','搜索人数','搜索占比','交易金额','uv价值']
    5.highCommodityIntention#商品高意向
        l02=['排名类目日期','店铺名','商品ID','收藏人数','加购人数','交易金额']
    6.brandHighTrading#品牌高交易
        l02=['排名类目日期','品牌信息','交易金额','交易增长幅度','支付转化率']
    7.brandHighFlow#品牌高流量
        l02=['排名类目日期','品牌信息','访客人数','搜索人数','搜索占比','交易金额','uv价值']

'''



































